# You can then easily install all of the dependencies with:
#
#       brew bundle
#
# You can also use Brewfile as a whitelist. It's useful for maintainers/testers
# who regularly install lots of formulae. To uninstall all Homebrew formulae
# not listed in Brewfile:
#
#       brew bundle cleanup
#

# -----------------------------------------------------------------------------
# General
# -----------------------------------------------------------------------------

tap "homebrew/cask"
tap "neovim/neovim"

brew "awscli"
brew "azure-cli"
brew "bash"
brew "bash-completion"
brew "binutils", link: true
brew "ctags"
brew "diff-so-fancy"
brew "dep"
brew "fzf"
brew "git"
brew "gnu-sed"
brew "go"
brew "htop"
brew "hub"
brew "jq"
brew "neovim"
#brew "parallel"
brew "python"
brew "python@2"
brew "reattach-to-user-namespace"
brew "ruby"
brew "terraform"
brew "the_silver_searcher"
brew "tmux"
brew "tree"
brew "vault"
brew "watch"
brew "youtube-dl"
brew "zsh"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"

# -----------------------------------------------------------------------------
# Kubernetes
# -----------------------------------------------------------------------------

brew "kubectx"

# -----------------------------------------------------------------------------
# Cask
# -----------------------------------------------------------------------------

cask "brave-browser"
cask "docker"
cask "fantastical"
cask "flycut"
cask "iterm2"
cask "karabiner-elements"
cask "keybase"
cask "notion"
cask "spectacle"
cask "tunnelblick"
cask "vagrant"
cask "virtualbox"
cask "vlc"

# -----------------------------------------------------------------------------
# Mas
# -----------------------------------------------------------------------------

mas "HP Easy Scan", id: 967004861
mas "Todoist", id: 585829637
mas "Todoist", id: 585829637
mas "Enpass", id: 732710998
mas "Slack", id: 803453959

# -----------------------------------------------------------------------------
# Keyboard
# -----------------------------------------------------------------------------

#tap "osx-cross/avr"
#tap "PX4/homebrew-px4"
#
#brew "avr-gcc@7", link: true, force: true
#brew "dfu-programmer"
#brew "dfu-util"
#brew "gcc-arm-none-eabi"
#brew "avrdude"
