# You can then easily install all of the dependencies with:
#
#       brew bundle
#
# You can also use Brewfile as a whitelist. It's useful for maintainers/testers
# who regularly install lots of formulae. To uninstall all Homebrew formulae
# not listed in Brewfile:
#
#       brew bundle cleanup
#

# -----------------------------------------------------------------------------
# General
# -----------------------------------------------------------------------------

tap "homebrew/cask"
tap "neovim/neovim"

brew "awscli"
brew "azure-cli"
brew "bash"
brew "bash-completion"
brew "binutils", link: true
brew "cmake" # For YouCompleteMe.
brew "diff-so-fancy"
brew "git"
brew "htop"
brew "jq"
brew "neovim"
brew "parallel"
brew "python"
brew "python@2"
brew "ruby"
brew "terraform"
brew "the_silver_searcher"
brew "tmux"
brew "tree"
brew "youtube-dl"
brew "zsh"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"

# -----------------------------------------------------------------------------
# Kubernetes
# -----------------------------------------------------------------------------

brew "kubectx"

# -----------------------------------------------------------------------------
# Cask
# -----------------------------------------------------------------------------

cask "station"
cask "vagrant"
cask "virtualbox"
cask "vlc"

# -----------------------------------------------------------------------------
# Keyboard
# -----------------------------------------------------------------------------

tap "osx-cross/avr"
tap "PX4/homebrew-px4"

brew "avr-gcc@7", link: true, force: true
brew "dfu-programmer"
brew "dfu-util"
brew "gcc-arm-none-eabi"
brew "avrdude"
