# You can then easily install all of the dependencies with:
#
#       brew bundle
#
# You can also use Brewfile as a whitelist. It's useful for maintainers/testers
# who regularly install lots of formulae. To uninstall all Homebrew formulae
# not listed in Brewfile:
#
#       brew bundle cleanup
#

# -----------------------------------------------------------------------------
# General
# -----------------------------------------------------------------------------

tap "homebrew/cask"

brew "awscli"
brew "azure-cli"
brew "bash"
brew "bash-completion"
brew "binutils", link: true
brew "ctags"
brew "dep"
brew "diff-so-fancy"
brew "ffmpeg"
brew "findutils"
brew "fzf"
brew "git"
brew "gitleaks"
brew "gh"
brew "gnu-sed"
brew "go"
brew "helm"
brew "helm@2"
brew "htop"
brew "hub"
brew "jq"
brew "kind"
brew "neovim"
brew "python"
brew "reattach-to-user-namespace"
brew "ruby"
brew "terraform"
brew "the_silver_searcher"
brew "tmux"
brew "tree"
brew "vault"
brew "watch"
brew "wget"
brew "youtube-dl"
brew "yq"
brew "zsh"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"

# -----------------------------------------------------------------------------
# Kubernetes
# -----------------------------------------------------------------------------

brew "kubectx"
brew "kustomize"

# -----------------------------------------------------------------------------
# Cask
# -----------------------------------------------------------------------------

cask "alacritty"
cask "brave-browser"
cask "docker"
cask "fantastical"
cask "flycut"
cask "iterm2"
cask "karabiner-elements"
cask "keybase"
cask "monitorcontrol"
cask "notion"
cask "openvpn-connect"
cask "vagrant"
cask "virtualbox"
cask "vlc"

# -----------------------------------------------------------------------------
# Mas
# -----------------------------------------------------------------------------

mas "AdGuard for Safari", id: 1440147259
mas "Cyph", id: 1480070821
mas "Cyph", id: 803453959
#mas "Duplicate Photos Fixer Pro", id: 963642514
mas "Enpass", id: 732710998
mas "HP Easy Scan", id: 967004861
mas "Slack", id: 803453959
mas "Todoist", id: 585829637
mas "Todoist", id: 585829637

# -----------------------------------------------------------------------------
# Keyboard
# -----------------------------------------------------------------------------

tap "homebrew/cask-drivers"
cask "qmk-toolbox"
